
# State **`s3://infrahouse-aws-control-289256138624/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |       10 |           5 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                  |
|:--------:|:-------------------------------------------------------------------------------------------|
|    🟢    | `module.buckets["infrahouse-aws-control-289256138624"].aws_dynamodb_table.terraform_locks` |
|    🟢    | `module.buckets["infrahouse-aws-control-289256138624"].random_pet.suffix`                  |
|    🟢    | `module.buckets["infrahouse-aws-control-303467602807"].aws_dynamodb_table.terraform_locks` |
|    🟢    | `module.buckets["infrahouse-aws-control-303467602807"].random_pet.suffix`                  |
|    🟢    | `module.buckets["infrahouse-aws-control-493370826424"].aws_dynamodb_table.terraform_locks` |
|    🟢    | `module.buckets["infrahouse-aws-control-493370826424"].random_pet.suffix`                  |
|    🟢    | `module.buckets["infrahouse-aws-control-990466748045"].aws_dynamodb_table.terraform_locks` |
|    🟢    | `module.buckets["infrahouse-aws-control-990466748045"].random_pet.suffix`                  |
|    🟢    | `module.buckets["infrahouse-website-infra"].aws_dynamodb_table.terraform_locks`            |
|    🟢    | `module.buckets["infrahouse-website-infra"].random_pet.suffix`                             |
|    🟡    | `module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket`         |
|    🟡    | `module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket`                    |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.buckets["infrahouse-aws-control-289256138624"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          + "repo"              = "infrahouse/aws-control-289256138624"
          + "state_bucket"      = "infrahouse-aws-control-289256138624"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          + "repo"              = "infrahouse/aws-control-289256138624"
          + "state_bucket"      = "infrahouse-aws-control-289256138624"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-289256138624"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-289256138624"
      ~ tags                        = {
          - "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          - "repo"        = "infrahouse/aws-control-289256138624"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for terraform-control account https://github.com/infrahouse/aws-control-289256138624"
          - "repo"        = "infrahouse/aws-control-289256138624"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-289256138624"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-289256138624"
      + separator = "-"
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          + "repo"              = "infrahouse/aws-control-303467602807"
          + "state_bucket"      = "infrahouse-aws-control-303467602807"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          + "repo"              = "infrahouse/aws-control-303467602807"
          + "state_bucket"      = "infrahouse-aws-control-303467602807"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-303467602807"
      ~ tags                        = {
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          - "repo"        = "infrahouse/aws-control-303467602807"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-303467602807"
          - "repo"        = "infrahouse/aws-control-303467602807"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-303467602807"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-303467602807"
      + separator = "-"
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          + "repo"              = "infrahouse/aws-control-493370826424"
          + "state_bucket"      = "infrahouse-aws-control-493370826424"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          + "repo"              = "infrahouse/aws-control-493370826424"
          + "state_bucket"      = "infrahouse-aws-control-493370826424"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-493370826424"
      ~ tags                        = {
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          - "repo"        = "infrahouse/aws-control-493370826424"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for ci-cd account https://github.com/infrahouse/aws-control-493370826424"
          - "repo"        = "infrahouse/aws-control-493370826424"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-493370826424"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-493370826424"
      + separator = "-"
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          + "repo"              = "infrahouse/aws-control"
          + "state_bucket"      = "infrahouse-aws-control-990466748045"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          + "repo"              = "infrahouse/aws-control"
          + "state_bucket"      = "infrahouse-aws-control-990466748045"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-aws-control-990466748045"
      ~ tags                        = {
          - "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          - "repo"        = "infrahouse/aws-control"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for the main AWS account 990466748045 https://github.com/infrahouse/aws-control"
          - "repo"        = "infrahouse/aws-control"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-aws-control-990466748045"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-aws-control-990466748045"
      + separator = "-"
    }

  # module.buckets["infrahouse-website-infra"].aws_dynamodb_table.terraform_locks will be created
  + resource "aws_dynamodb_table" "terraform_locks" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = (known after apply)
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          + "repo"              = "infrahouse/infrahouse-website-infra"
          + "state_bucket"      = "infrahouse-website-infra"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-289256138624"
          + "created_by_module" = "infrahouse/state-bucket/aws"
          + "description"       = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          + "repo"              = "infrahouse/infrahouse-website-infra"
          + "state_bucket"      = "infrahouse-website-infra"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl (known after apply)
    }

  # module.buckets["infrahouse-website-infra"].aws_s3_bucket.state-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "state-bucket" {
        id                          = "infrahouse-website-infra"
      ~ tags                        = {
          - "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          - "repo"        = "infrahouse/infrahouse-website-infra"
        } -> (known after apply)
      ~ tags_all                    = {
          - "created_by"  = "infrahouse/aws-control-289256138624"
          - "description" = "Terraform state for https://github.com/infrahouse/infrahouse-website-infra"
          - "repo"        = "infrahouse/infrahouse-website-infra"
        } -> (known after apply)
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.buckets["infrahouse-website-infra"].random_pet.suffix will be created
  + resource "random_pet" "suffix" {
      + id        = (known after apply)
      + length    = 2
      + prefix    = "infrahouse-website-infra"
      + separator = "-"
    }

Plan: 10 to add, 5 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMjg5MjU2MTM4NjI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEwLCAiY2hhbmdlIjogNSwgImRlc3Ryb3kiOiAwfX0=
```
</details>